//********************************************* 9 对 0**********/
//********************************************* 9 对 1**********/
//********************************************* 9 对 2**********/
//********************************************* 9 对 3**********/
//********************************************* 9 对 4**********/
//********************************************* 9 对 5**********/
//#define my_m_MT_R_1che2pao2ma5pawn_B_1che1pao2ma2pawn            m_MT_B_1che1pao2ma5pawn_R_1che1pao2ma2pawn
//#define my_m_MT_R_1che2pao2ma5pawn_B_1che1pao2ma2pawn            m_MT_B_1che2pao1ma5pawn_R_1che1pao2ma2pawn

#define my_m_MT_R_2pao2ma5pawn_B_1che2pao2pawn                   m_MT_B_2pao2ma5pawn_R_1che2pao2pawn
//********************************************* 9 对 6**********/
#define my_m_MT_R_1che1pao2ma5pawn_B_1che1pao2ma2pawn            m_MT_B_1che1pao2ma5pawn_R_1che1pao2ma2pawn
#define my_m_MT_R_1che2pao1ma5pawn_B_1che1pao2ma2pawn            m_MT_B_1che2pao1ma5pawn_R_1che1pao2ma2pawn
//********************************************* 9 对 7**********/
//********************************************* 9 对 8**********/
//********************************************* 9 对 9**********/