#ifndef E_InitMatFunction9
#define E_InitMatFunction9
#include "..\\chess.h"
 
#include "..\\white.h"
#else
#include "..\\black.h"
#endif


void InitMatFunction9(void){
	//********************************************* 9 ¶Ô 0**********/
	//********************************************* 9 ¶Ô 1**********/
	//********************************************* 9 ¶Ô 2**********/
	//********************************************* 9 ¶Ô 3**********/
	//********************************************* 9 ¶Ô 4**********/

	//********************************************* 9 ¶Ô 5**********/

	//           ºì±ø  ºÚ×ä ºì³µ ºìÂí ºìÅÚ ºÚ³µ ºÚÂí ºÚÅÚ  
	funMat[MARR->a[5]  [2]  [0]  [2]  [2]  [1]  [0]  [2]  ]  = m_MT_R_2pao2ma5pawn_B_1che2pao2pawn;
	funMat[MARR->a[2]  [5]  [1]  [0]  [2]  [0]  [2]  [2]  ]  = m_MT_B_2pao2ma5pawn_R_1che2pao2pawn;
	//************************************9 ¶Ô 6**********
	//           ºì±ø  ºÚ×ä ºì³µ ºìÂí ºìÅÚ ºÚ³µ ºÚÂí ºÚÅÚ  
	funMat[MARR->a[5]  [2]  [1]  [2]  [1]  [1]  [2]  [1]  ]  = m_MT_R_1che1pao2ma5pawn_B_1che1pao2ma2pawn;
	funMat[MARR->a[2]  [5]  [1]  [2]  [1]  [1]  [2]  [1]  ]  = m_MT_B_1che1pao2ma5pawn_R_1che1pao2ma2pawn;

	//           ºì±ø  ºÚ×ä ºì³µ ºìÂí ºìÅÚ ºÚ³µ ºÚÂí ºÚÅÚ  
	funMat[MARR->a[5]  [2]  [1]  [1]  [2]  [1]  [2]  [1]  ]  = m_MT_R_1che2pao1ma5pawn_B_1che1pao2ma2pawn;
	funMat[MARR->a[2]  [5]  [1]  [2]  [1]  [1]  [1]  [2]  ]  = m_MT_B_1che2pao1ma5pawn_R_1che1pao2ma2pawn;
	//********************************************* 9 ¶Ô 7**********/
	//********************************************* 9 ¶Ô 8**********/
	//********************************************* 9 ¶Ô 9**********/
}